music_app/app/models/user.rb

    def self.find_by_credentials(email, password)
        user = User.find_by(email: username)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "i"], ["LIMIT", 1]]

    def reset_session_token!
        self.session_token = generate_session_token
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-06-13 18:54:56.906800"], ["id", 1]]