music_app/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user
            @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "jason"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-06-13 23:03:29.623043"], ["updated_at", "2023-06-13 23:03:29.623043"]]